wwatson4506/Devboard4-5_hardware/hardware/teensy-dev/avr/boards.txt
# Solution for Arduino IDE 2.0 recognizing changes to this file:
# https://github.com/arduino/arduino-ide/issues/1030#issuecomment-1152005617
menu.usb=USB Type
menu.speed=CPU Speed
menu.opt=Optimize
menu.keys=Keyboard Layout



teensyDevBrd4.name=Teensy DevBoard V4.0
#teensyDevBrd4.upload.maximum_size=16515072
teensyDevBrd4.build.board=TEENSY_DEVBRD4
#teensyDevBrd4.build.flags.ld=-Wl,--gc-sections,--relax "-T{build.core.path}/imxrt1062_mm.ld"
teensyDevBrd4.build.flags.ld=-Wl,--gc-sections,--relax "-T{build.variant.path}/imxrt1062_mm_sdram.ld"
#teensyDevBrd4.upload.maximum_data_size=524288
#teensyDevBrd4.upload.maximum_data_size=1048576
teensyDevBrd4.upload.tool=teensy:teensyloader
teensyDevBrd4.upload.tool.default=teensy:teensyloader
teensyDevBrd4.upload.tool.teensy=Teensy:teensyloader
teensyDevBrd4.upload.protocol=teensy
teensyDevBrd4.upload_port.modelID=0x26
teensyDevBrd4.build.core=teensy:teensy4
teensyDevBrd4.build.mcu=imxrt1062
teensyDevBrd4.build.variant=SDRAM
teensyDevBrd4.build.includes=-I{build.variant.path}

teensyDevBrd4.build.warn_data_percentage=99
teensyDevBrd4.build.toolchain=arm/bin/
teensyDevBrd4.build.command.gcc=arm-none-eabi-gcc
teensyDevBrd4.build.command.g++=arm-none-eabi-g++
teensyDevBrd4.build.command.ar=arm-none-eabi-gcc-ar
teensyDevBrd4.build.command.objcopy=arm-none-eabi-objcopy
teensyDevBrd4.build.command.objdump=arm-none-eabi-objdump
teensyDevBrd4.build.command.linker=arm-none-eabi-gcc
teensyDevBrd4.build.command.size=arm-none-eabi-size
teensyDevBrd4.build.flags.common=-g -Wall -ffunction-sections -fdata-sections -nostdlib
teensyDevBrd4.build.flags.dep=-MMD
teensyDevBrd4.build.flags.optimize=-Os
teensyDevBrd4.build.flags.cpu=-mthumb -mcpu=cortex-m7 -mfloat-abi=hard -mfpu=fpv5-d16
#teensyDevBrd4.build.flags.defs=-D__IMXRT1062__ -DTEENSYDUINO=159
teensyDevBrd4.build.flags.defs=-D__IMXRT1062__ -DTEENSYDUINO=159 -DARDUINO_TEENSY_MICROMOD
teensyDevBrd4.build.flags.cpp=-std=gnu++17 -fno-exceptions -fpermissive -fno-rtti -fno-threadsafe-statics -felide-constructors -Wno-error=narrowing
teensyDevBrd4.build.flags.c=
teensyDevBrd4.build.flags.S=-x assembler-with-cpp
teensyDevBrd4.build.flags.libs=-larm_cortexM7lfsp_math -lm -lstdc++
teensyDevBrd4.serial.restart_cmd=false
teensyDevBrd4.menu.usb.serial=Serial
teensyDevBrd4.menu.usb.serial.build.usbtype=USB_SERIAL
teensyDevBrd4.menu.usb.serial.upload_port.usbtype=USB_SERIAL
teensyDevBrd4.menu.usb.serial2=Dual Serial
teensyDevBrd4.menu.usb.serial2.build.usbtype=USB_DUAL_SERIAL
teensyDevBrd4.menu.usb.serial2.upload_port.usbtype=USB_DUAL_SERIAL
teensyDevBrd4.menu.usb.serial3=Triple Serial
teensyDevBrd4.menu.usb.serial3.build.usbtype=USB_TRIPLE_SERIAL
teensyDevBrd4.menu.usb.serial3.upload_port.usbtype=USB_TRIPLE_SERIAL
teensyDevBrd4.menu.usb.keyboard=Keyboard
teensyDevBrd4.menu.usb.keyboard.build.usbtype=USB_KEYBOARDONLY
teensyDevBrd4.menu.usb.keyboard.upload_port.usbtype=USB_KEYBOARDONLY
teensyDevBrd4.menu.usb.keyboard.fake_serial=teensy_gateway
teensyDevBrd4.menu.usb.touch=Keyboard + Touch Screen
teensyDevBrd4.menu.usb.touch.build.usbtype=USB_TOUCHSCREEN
teensyDevBrd4.menu.usb.touch.upload_port.usbtype=USB_TOUCHSCREEN
teensyDevBrd4.menu.usb.touch.fake_serial=teensy_gateway
teensyDevBrd4.menu.usb.hidtouch=Keyboard + Mouse + Touch Screen
teensyDevBrd4.menu.usb.hidtouch.build.usbtype=USB_HID_TOUCHSCREEN
teensyDevBrd4.menu.usb.hidtouch.upload_port.usbtype=USB_HID_TOUCHSCREEN
teensyDevBrd4.menu.usb.hidtouch.fake_serial=teensy_gateway
teensyDevBrd4.menu.usb.hid=Keyboard + Mouse + Joystick
teensyDevBrd4.menu.usb.hid.build.usbtype=USB_HID
teensyDevBrd4.menu.usb.hid.upload_port.usbtype=USB_HID
teensyDevBrd4.menu.usb.hid.fake_serial=teensy_gateway
teensyDevBrd4.menu.usb.serialhid=Serial + Keyboard + Mouse + Joystick
teensyDevBrd4.menu.usb.serialhid.build.usbtype=USB_SERIAL_HID
teensyDevBrd4.menu.usb.serialhid.upload_port.usbtype=USB_SERIAL_HID
teensyDevBrd4.menu.usb.midi=MIDI
teensyDevBrd4.menu.usb.midi.build.usbtype=USB_MIDI
teensyDevBrd4.menu.usb.midi.upload_port.usbtype=USB_MIDI
teensyDevBrd4.menu.usb.midi.fake_serial=teensy_gateway
teensyDevBrd4.menu.usb.midi4=MIDIx4
teensyDevBrd4.menu.usb.midi4.build.usbtype=USB_MIDI4
teensyDevBrd4.menu.usb.midi4.upload_port.usbtype=USB_MIDI4
teensyDevBrd4.menu.usb.midi4.fake_serial=teensy_gateway
teensyDevBrd4.menu.usb.midi16=MIDIx16
teensyDevBrd4.menu.usb.midi16.build.usbtype=USB_MIDI16
teensyDevBrd4.menu.usb.midi16.upload_port.usbtype=USB_MIDI16
teensyDevBrd4.menu.usb.midi16.fake_serial=teensy_gateway
teensyDevBrd4.menu.usb.serialmidi=Serial + MIDI
teensyDevBrd4.menu.usb.serialmidi.build.usbtype=USB_MIDI_SERIAL
teensyDevBrd4.menu.usb.serialmidi.upload_port.usbtype=USB_MIDI_SERIAL
teensyDevBrd4.menu.usb.serialmidi4=Serial + MIDIx4
teensyDevBrd4.menu.usb.serialmidi4.build.usbtype=USB_MIDI4_SERIAL
teensyDevBrd4.menu.usb.serialmidi4.upload_port.usbtype=USB_MIDI4_SERIAL
teensyDevBrd4.menu.usb.serialmidi16=Serial + MIDIx16
teensyDevBrd4.menu.usb.serialmidi16.build.usbtype=USB_MIDI16_SERIAL
teensyDevBrd4.menu.usb.serialmidi16.upload_port.usbtype=USB_MIDI16_SERIAL
teensyDevBrd4.menu.usb.audio=Audio
teensyDevBrd4.menu.usb.audio.build.usbtype=USB_AUDIO
teensyDevBrd4.menu.usb.audio.upload_port.usbtype=USB_AUDIO
teensyDevBrd4.menu.usb.audio.fake_serial=teensy_gateway
teensyDevBrd4.menu.usb.serialmidiaudio=Serial + MIDI + Audio
teensyDevBrd4.menu.usb.serialmidiaudio.build.usbtype=USB_MIDI_AUDIO_SERIAL
teensyDevBrd4.menu.usb.serialmidiaudio.upload_port.usbtype=USB_MIDI_AUDIO_SERIAL
teensyDevBrd4.menu.usb.serialmidi16audio=Serial + MIDIx16 + Audio
teensyDevBrd4.menu.usb.serialmidi16audio.build.usbtype=USB_MIDI16_AUDIO_SERIAL
teensyDevBrd4.menu.usb.serialmidi16audio.upload_port.usbtype=USB_MIDI16_AUDIO_SERIAL
teensyDevBrd4.menu.usb.mtp=MTP Disk (Experimental)
teensyDevBrd4.menu.usb.mtp.build.usbtype=USB_MTPDISK
teensyDevBrd4.menu.usb.mtp.upload_port.usbtype=USB_MTPDISK
teensyDevBrd4.menu.usb.mtp.fake_serial=teensy_gateway
teensyDevBrd4.menu.usb.serialmtp=Serial + MTP Disk (Experimental)
teensyDevBrd4.menu.usb.serialmtp.build.usbtype=USB_MTPDISK_SERIAL
teensyDevBrd4.menu.usb.serialmtp.upload_port.usbtype=USB_MTPDISK_SERIAL
teensyDevBrd4.menu.usb.rawhid=Raw HID
teensyDevBrd4.menu.usb.rawhid.build.usbtype=USB_RAWHID
teensyDevBrd4.menu.usb.rawhid.upload_port.usbtype=USB_RAWHID
teensyDevBrd4.menu.usb.rawhid.fake_serial=teensy_gateway
teensyDevBrd4.menu.usb.flightsim=Flight Sim Controls
teensyDevBrd4.menu.usb.flightsim.build.usbtype=USB_FLIGHTSIM
teensyDevBrd4.menu.usb.flightsim.upload_port.usbtype=USB_FLIGHTSIM
teensyDevBrd4.menu.usb.flightsim.fake_serial=teensy_gateway
teensyDevBrd4.menu.usb.flightsimjoystick=Flight Sim Controls + Joystick
teensyDevBrd4.menu.usb.flightsimjoystick.build.usbtype=USB_FLIGHTSIM_JOYSTICK
teensyDevBrd4.menu.usb.flightsimjoystick.upload_port.usbtype=USB_FLIGHTSIM_JOYSTICK
teensyDevBrd4.menu.usb.flightsimjoystick.fake_serial=teensy_gateway
#teensyDevBrd4.menu.usb.disable=No USB
#teensyDevBrd4.menu.usb.disable.build.usbtype=USB_DISABLED

teensyDevBrd4.menu.speed.600=600 MHz
teensyDevBrd4.menu.speed.582=582 MH2
teensyDevBrd4.menu.speed.564=564 MHz
teensyDevBrd4.menu.speed.557=557 MHz
teensyDevBrd4.menu.speed.532=532 MHz
teensyDevBrd4.menu.speed.528=528 MHz
teensyDevBrd4.menu.speed.507=507 MHz
teensyDevBrd4.menu.speed.450=450 MHz
teensyDevBrd4.menu.speed.396=396 MHz
teensyDevBrd4.menu.speed.150=150 MHz
teensyDevBrd4.menu.speed.24=24 MHz
teensyDevBrd4.menu.speed.600.build.fcpu=600000000
teensyDevBrd4.menu.speed.582.build.fcpu=582000000
teensyDevBrd4.menu.speed.564.build.fcpu=564000000
teensyDevBrd4.menu.speed.557.build.fcpu=557000000
teensyDevBrd4.menu.speed.532.build.fcpu=532000000
teensyDevBrd4.menu.speed.528.build.fcpu=528000000
teensyDevBrd4.menu.speed.507.build.fcpu=507000000
teensyDevBrd4.menu.speed.450.build.fcpu=450000000
teensyDevBrd4.menu.speed.396.build.fcpu=396000000
teensyDevBrd4.menu.speed.150.build.fcpu=150000000
teensyDevBrd4.menu.speed.24.build.fcpu=24000000

