wwatson4506/Devboard4-5_hardware/hardware/teensy-dev/avr/boards.txt
teensyDevBrd4.menu.opt.o2std=Faster
teensyDevBrd4.menu.opt.o2std.build.flags.optimize=-O2
teensyDevBrd4.menu.opt.o2std.build.flags.ldspecs=
teensyDevBrd4.menu.opt.o2lto=Faster with LTO
teensyDevBrd4.menu.opt.o2lto.build.flags.optimize=-O2 -flto -fno-fat-lto-objects
teensyDevBrd4.menu.opt.o2lto.build.flags.ldspecs=-fuse-linker-plugin
teensyDevBrd4.menu.opt.o1std=Fast
teensyDevBrd4.menu.opt.o1std.build.flags.optimize=-O1
teensyDevBrd4.menu.opt.o1std.build.flags.ldspecs=
teensyDevBrd4.menu.opt.o1lto=Fast with LTO
teensyDevBrd4.menu.opt.o1lto.build.flags.optimize=-O1 -flto -fno-fat-lto-objects
teensyDevBrd4.menu.opt.o1lto.build.flags.ldspecs=-fuse-linker-plugin
teensyDevBrd4.menu.opt.o3std=Fastest
teensyDevBrd4.menu.opt.o3std.build.flags.optimize=-O3
teensyDevBrd4.menu.opt.o3std.build.flags.ldspecs=
#teensyDevBrd4.menu.opt.o3purestd=Fastest + pure-code
#teensyDevBrd4.menu.opt.o3purestd.build.flags.optimize=-O3 -mpure-code -D__PURE_CODE__
#teensyDevBrd4.menu.opt.o3purestd.build.flags.ldspecs=
teensyDevBrd4.menu.opt.o3lto=Fastest with LTO
teensyDevBrd4.menu.opt.o3lto.build.flags.optimize=-O3 -flto -fno-fat-lto-objects
teensyDevBrd4.menu.opt.o3lto.build.flags.ldspecs=-fuse-linker-plugin
#teensyDevBrd4.menu.opt.o3purelto=Fastest + pure-code with LTO
#teensyDevBrd4.menu.opt.o3purelto.build.flags.optimize=-O3 -mpure-code -D__PURE_CODE__ -flto -fno-fat-lto-objects
#teensyDevBrd4.menu.opt.o3purelto.build.flags.ldspecs=-fuse-linker-plugin
teensyDevBrd4.menu.opt.ogstd=Debug
teensyDevBrd4.menu.opt.ogstd.build.flags.optimize=-Og
teensyDevBrd4.menu.opt.ogstd.build.flags.ldspecs=
#teensyDevBrd4.menu.opt.oglto=Debug with LTO
#teensyDevBrd4.menu.opt.oglto.build.flags.optimize=-Og -flto -fno-fat-lto-objects
#teensyDevBrd4.menu.opt.oglto.build.flags.ldspecs=-fuse-linker-plugin
teensyDevBrd4.menu.opt.osstd=Smallest Code
teensyDevBrd4.menu.opt.osstd.build.flags.optimize=-Os --specs=nano.specs
teensyDevBrd4.menu.opt.osstd.build.flags.ldspecs=
teensyDevBrd4.menu.opt.oslto=Smallest Code with LTO
teensyDevBrd4.menu.opt.oslto.build.flags.optimize=-Os -flto -fno-fat-lto-objects --specs=nano.specs
teensyDevBrd4.menu.opt.oslto.build.flags.ldspecs=-fuse-linker-plugin

teensyDevBrd4.menu.keys.en-us=US English
teensyDevBrd4.menu.keys.en-us.build.keylayout=US_ENGLISH
teensyDevBrd4.menu.keys.fr-ca=Canadian French
teensyDevBrd4.menu.keys.fr-ca.build.keylayout=CANADIAN_FRENCH
teensyDevBrd4.menu.keys.xx-ca=Canadian Multilingual
teensyDevBrd4.menu.keys.xx-ca.build.keylayout=CANADIAN_MULTILINGUAL
teensyDevBrd4.menu.keys.cz-cz=Czech
teensyDevBrd4.menu.keys.cz-cz.build.keylayout=CZECH
teensyDevBrd4.menu.keys.da-da=Danish
teensyDevBrd4.menu.keys.da-da.build.keylayout=DANISH
teensyDevBrd4.menu.keys.fi-fi=Finnish
teensyDevBrd4.menu.keys.fi-fi.build.keylayout=FINNISH
teensyDevBrd4.menu.keys.fr-fr=French
teensyDevBrd4.menu.keys.fr-fr.build.keylayout=FRENCH
teensyDevBrd4.menu.keys.fr-be=French Belgian
teensyDevBrd4.menu.keys.fr-be.build.keylayout=FRENCH_BELGIAN
teensyDevBrd4.menu.keys.fr-ch=French Swiss
teensyDevBrd4.menu.keys.fr-ch.build.keylayout=FRENCH_SWISS
teensyDevBrd4.menu.keys.de-de=German
teensyDevBrd4.menu.keys.de-de.build.keylayout=GERMAN
teensyDevBrd4.menu.keys.de-dm=German (Mac)
teensyDevBrd4.menu.keys.de-dm.build.keylayout=GERMAN_MAC
teensyDevBrd4.menu.keys.de-ch=German Swiss
teensyDevBrd4.menu.keys.de-ch.build.keylayout=GERMAN_SWISS
teensyDevBrd4.menu.keys.is-is=Icelandic
teensyDevBrd4.menu.keys.is-is.build.keylayout=ICELANDIC
teensyDevBrd4.menu.keys.en-ie=Irish
teensyDevBrd4.menu.keys.en-ie.build.keylayout=IRISH
teensyDevBrd4.menu.keys.it-it=Italian
teensyDevBrd4.menu.keys.it-it.build.keylayout=ITALIAN
teensyDevBrd4.menu.keys.no-no=Norwegian
teensyDevBrd4.menu.keys.no-no.build.keylayout=NORWEGIAN
teensyDevBrd4.menu.keys.pt-pt=Portuguese
teensyDevBrd4.menu.keys.pt-pt.build.keylayout=PORTUGUESE
teensyDevBrd4.menu.keys.pt-br=Portuguese Brazilian
teensyDevBrd4.menu.keys.pt-br.build.keylayout=PORTUGUESE_BRAZILIAN
teensyDevBrd4.menu.keys.rs-rs=Serbian (Latin Only)
teensyDevBrd4.menu.keys.rs-rs.build.keylayout=SERBIAN_LATIN_ONLY
teensyDevBrd4.menu.keys.es-es=Spanish
teensyDevBrd4.menu.keys.es-es.build.keylayout=SPANISH
teensyDevBrd4.menu.keys.es-mx=Spanish Latin America
teensyDevBrd4.menu.keys.es-mx.build.keylayout=SPANISH_LATIN_AMERICA
teensyDevBrd4.menu.keys.sv-se=Swedish
teensyDevBrd4.menu.keys.sv-se.build.keylayout=SWEDISH
teensyDevBrd4.menu.keys.tr-tr=Turkish (partial)
teensyDevBrd4.menu.keys.tr-tr.build.keylayout=TURKISH
teensyDevBrd4.menu.keys.en-gb=United Kingdom
teensyDevBrd4.menu.keys.en-gb.build.keylayout=UNITED_KINGDOM
teensyDevBrd4.menu.keys.usint=US International
teensyDevBrd4.menu.keys.usint.build.keylayout=US_INTERNATIONAL

teensyDevBrd5.name=Teensy DevBoard V5.0
#teensyDevBrd5.upload.maximum_size=16515072
teensyDevBrd5.build.board=TEENSY_DEVBRD5
#teensyDevBrd5.build.flags.ld=-Wl,--gc-sections,--relax "-T{build.core.path}/imxrt1062_mm.ld"
teensyDevBrd5.build.flags.ld=-Wl,--gc-sections,--relax "-T{build.variant.path}/imxrt1062_mm_sdram.ld"
#teensyDevBrd5.upload.maximum_data_size=524288
#teensyDevBrd5.upload.maximum_data_size=1048576
teensyDevBrd5.upload.tool=teensy:teensyloader
teensyDevBrd5.upload.tool.default=teensy:teensyloader
teensyDevBrd5.upload.tool.teensy=Teensy:teensyloader
teensyDevBrd5.upload.protocol=teensy
teensyDevBrd5.upload_port.modelID=0x26
teensyDevBrd5.build.core=teensy:teensy4
teensyDevBrd5.build.mcu=imxrt1062
teensyDevBrd5.build.variant=DevBrd5
teensyDevBrd5.build.includes=-I{build.variant.path}

teensyDevBrd5.build.warn_data_percentage=99
teensyDevBrd5.build.toolchain=arm/bin/
teensyDevBrd5.build.command.gcc=arm-none-eabi-gcc
teensyDevBrd5.build.command.g++=arm-none-eabi-g++
teensyDevBrd5.build.command.ar=arm-none-eabi-gcc-ar
teensyDevBrd5.build.command.objcopy=arm-none-eabi-objcopy
teensyDevBrd5.build.command.objdump=arm-none-eabi-objdump
teensyDevBrd5.build.command.linker=arm-none-eabi-gcc
teensyDevBrd5.build.command.size=arm-none-eabi-size
teensyDevBrd5.build.flags.common=-g -Wall -ffunction-sections -fdata-sections -nostdlib
teensyDevBrd5.build.flags.dep=-MMD
teensyDevBrd5.build.flags.optimize=-Os
teensyDevBrd5.build.flags.cpu=-mthumb -mcpu=cortex-m7 -mfloat-abi=hard -mfpu=fpv5-d16
#teensyDevBrd5.build.flags.defs=-D__IMXRT1062__ -DTEENSYDUINO=159
teensyDevBrd5.build.flags.defs=-D__IMXRT1062__ -DTEENSYDUINO=159 -DARDUINO_TEENSY_MICROMOD
teensyDevBrd5.build.flags.cpp=-std=gnu++17 -fno-exceptions -fpermissive -fno-rtti -fno-threadsafe-statics -felide-constructors -Wno-error=narrowing
teensyDevBrd5.build.flags.c=
teensyDevBrd5.build.flags.S=-x assembler-with-cpp
teensyDevBrd5.build.flags.libs=-larm_cortexM7lfsp_math -lm -lstdc++
teensyDevBrd5.serial.restart_cmd=false
teensyDevBrd5.menu.usb.serial=Serial
teensyDevBrd5.menu.usb.serial.build.usbtype=USB_SERIAL
teensyDevBrd5.menu.usb.serial.upload_port.usbtype=USB_SERIAL
teensyDevBrd5.menu.usb.serial2=Dual Serial
teensyDevBrd5.menu.usb.serial2.build.usbtype=USB_DUAL_SERIAL
teensyDevBrd5.menu.usb.serial2.upload_port.usbtype=USB_DUAL_SERIAL
teensyDevBrd5.menu.usb.serial3=Triple Serial
teensyDevBrd5.menu.usb.serial3.build.usbtype=USB_TRIPLE_SERIAL
teensyDevBrd5.menu.usb.serial3.upload_port.usbtype=USB_TRIPLE_SERIAL
teensyDevBrd5.menu.usb.keyboard=Keyboard
teensyDevBrd5.menu.usb.keyboard.build.usbtype=USB_KEYBOARDONLY
teensyDevBrd5.menu.usb.keyboard.upload_port.usbtype=USB_KEYBOARDONLY
teensyDevBrd5.menu.usb.keyboard.fake_serial=teensy_gateway
teensyDevBrd5.menu.usb.touch=Keyboard + Touch Screen
teensyDevBrd5.menu.usb.touch.build.usbtype=USB_TOUCHSCREEN
teensyDevBrd5.menu.usb.touch.upload_port.usbtype=USB_TOUCHSCREEN
teensyDevBrd5.menu.usb.touch.fake_serial=teensy_gateway
teensyDevBrd5.menu.usb.hidtouch=Keyboard + Mouse + Touch Screen
teensyDevBrd5.menu.usb.hidtouch.build.usbtype=USB_HID_TOUCHSCREEN
teensyDevBrd5.menu.usb.hidtouch.upload_port.usbtype=USB_HID_TOUCHSCREEN
teensyDevBrd5.menu.usb.hidtouch.fake_serial=teensy_gateway
teensyDevBrd5.menu.usb.hid=Keyboard + Mouse + Joystick
teensyDevBrd5.menu.usb.hid.build.usbtype=USB_HID
teensyDevBrd5.menu.usb.hid.upload_port.usbtype=USB_HID
teensyDevBrd5.menu.usb.hid.fake_serial=teensy_gateway
teensyDevBrd5.menu.usb.serialhid=Serial + Keyboard + Mouse + Joystick
teensyDevBrd5.menu.usb.serialhid.build.usbtype=USB_SERIAL_HID
teensyDevBrd5.menu.usb.serialhid.upload_port.usbtype=USB_SERIAL_HID
teensyDevBrd5.menu.usb.midi=MIDI
teensyDevBrd5.menu.usb.midi.build.usbtype=USB_MIDI
teensyDevBrd5.menu.usb.midi.upload_port.usbtype=USB_MIDI
teensyDevBrd5.menu.usb.midi.fake_serial=teensy_gateway
teensyDevBrd5.menu.usb.midi4=MIDIx4
teensyDevBrd5.menu.usb.midi4.build.usbtype=USB_MIDI4
teensyDevBrd5.menu.usb.midi4.upload_port.usbtype=USB_MIDI4
teensyDevBrd5.menu.usb.midi4.fake_serial=teensy_gateway
teensyDevBrd5.menu.usb.midi16=MIDIx16
teensyDevBrd5.menu.usb.midi16.build.usbtype=USB_MIDI16
teensyDevBrd5.menu.usb.midi16.upload_port.usbtype=USB_MIDI16
teensyDevBrd5.menu.usb.midi16.fake_serial=teensy_gateway
teensyDevBrd5.menu.usb.serialmidi=Serial + MIDI
teensyDevBrd5.menu.usb.serialmidi.build.usbtype=USB_MIDI_SERIAL
teensyDevBrd5.menu.usb.serialmidi.upload_port.usbtype=USB_MIDI_SERIAL
teensyDevBrd5.menu.usb.serialmidi4=Serial + MIDIx4
teensyDevBrd5.menu.usb.serialmidi4.build.usbtype=USB_MIDI4_SERIAL
teensyDevBrd5.menu.usb.serialmidi4.upload_port.usbtype=USB_MIDI4_SERIAL
teensyDevBrd5.menu.usb.serialmidi16=Serial + MIDIx16
teensyDevBrd5.menu.usb.serialmidi16.build.usbtype=USB_MIDI16_SERIAL
teensyDevBrd5.menu.usb.serialmidi16.upload_port.usbtype=USB_MIDI16_SERIAL
teensyDevBrd5.menu.usb.audio=Audio
teensyDevBrd5.menu.usb.audio.build.usbtype=USB_AUDIO
teensyDevBrd5.menu.usb.audio.upload_port.usbtype=USB_AUDIO
teensyDevBrd5.menu.usb.audio.fake_serial=teensy_gateway
teensyDevBrd5.menu.usb.serialmidiaudio=Serial + MIDI + Audio
teensyDevBrd5.menu.usb.serialmidiaudio.build.usbtype=USB_MIDI_AUDIO_SERIAL
teensyDevBrd5.menu.usb.serialmidiaudio.upload_port.usbtype=USB_MIDI_AUDIO_SERIAL
teensyDevBrd5.menu.usb.serialmidi16audio=Serial + MIDIx16 + Audio
teensyDevBrd5.menu.usb.serialmidi16audio.build.usbtype=USB_MIDI16_AUDIO_SERIAL
teensyDevBrd5.menu.usb.serialmidi16audio.upload_port.usbtype=USB_MIDI16_AUDIO_SERIAL
teensyDevBrd5.menu.usb.mtp=MTP Disk (Experimental)
teensyDevBrd5.menu.usb.mtp.build.usbtype=USB_MTPDISK
teensyDevBrd5.menu.usb.mtp.upload_port.usbtype=USB_MTPDISK
teensyDevBrd5.menu.usb.mtp.fake_serial=teensy_gateway
teensyDevBrd5.menu.usb.serialmtp=Serial + MTP Disk (Experimental)
teensyDevBrd5.menu.usb.serialmtp.build.usbtype=USB_MTPDISK_SERIAL
teensyDevBrd5.menu.usb.serialmtp.upload_port.usbtype=USB_MTPDISK_SERIAL
teensyDevBrd5.menu.usb.rawhid=Raw HID
teensyDevBrd5.menu.usb.rawhid.build.usbtype=USB_RAWHID
teensyDevBrd5.menu.usb.rawhid.upload_port.usbtype=USB_RAWHID
teensyDevBrd5.menu.usb.rawhid.fake_serial=teensy_gateway
teensyDevBrd5.menu.usb.flightsim=Flight Sim Controls
teensyDevBrd5.menu.usb.flightsim.build.usbtype=USB_FLIGHTSIM
teensyDevBrd5.menu.usb.flightsim.upload_port.usbtype=USB_FLIGHTSIM
teensyDevBrd5.menu.usb.flightsim.fake_serial=teensy_gateway
teensyDevBrd5.menu.usb.flightsimjoystick=Flight Sim Controls + Joystick
teensyDevBrd5.menu.usb.flightsimjoystick.build.usbtype=USB_FLIGHTSIM_JOYSTICK
teensyDevBrd5.menu.usb.flightsimjoystick.upload_port.usbtype=USB_FLIGHTSIM_JOYSTICK
teensyDevBrd5.menu.usb.flightsimjoystick.fake_serial=teensy_gateway
#teensyDevBrd5.menu.usb.disable=No USB
#teensyDevBrd5.menu.usb.disable.build.usbtype=USB_DISABLED

