wwatson4506/Devboard4-5_hardware/hardware/teensy-dev/avr/boards.txt
teensyDevBrd5.menu.speed.600=600 MHz
teensyDevBrd5.menu.speed.582=582 MH2
teensyDevBrd5.menu.speed.564=564 MHz
teensyDevBrd5.menu.speed.557=557 MHz
teensyDevBrd5.menu.speed.532=532 MHz
teensyDevBrd5.menu.speed.528=528 MHz
teensyDevBrd5.menu.speed.507=507 MHz
teensyDevBrd5.menu.speed.450=450 MHz
teensyDevBrd5.menu.speed.396=396 MHz
teensyDevBrd5.menu.speed.150=150 MHz
teensyDevBrd5.menu.speed.24=24 MHz
teensyDevBrd5.menu.speed.600.build.fcpu=600000000
teensyDevBrd5.menu.speed.582.build.fcpu=582000000
teensyDevBrd5.menu.speed.564.build.fcpu=564000000
teensyDevBrd5.menu.speed.557.build.fcpu=557000000
teensyDevBrd5.menu.speed.532.build.fcpu=532000000
teensyDevBrd5.menu.speed.528.build.fcpu=528000000
teensyDevBrd5.menu.speed.507.build.fcpu=507000000
teensyDevBrd5.menu.speed.450.build.fcpu=450000000
teensyDevBrd5.menu.speed.396.build.fcpu=396000000
teensyDevBrd5.menu.speed.150.build.fcpu=150000000
teensyDevBrd5.menu.speed.24.build.fcpu=24000000

teensyDevBrd5.menu.opt.o2std=Faster
teensyDevBrd5.menu.opt.o2std.build.flags.optimize=-O2
teensyDevBrd5.menu.opt.o2std.build.flags.ldspecs=
teensyDevBrd5.menu.opt.o2lto=Faster with LTO
teensyDevBrd5.menu.opt.o2lto.build.flags.optimize=-O2 -flto -fno-fat-lto-objects
teensyDevBrd5.menu.opt.o2lto.build.flags.ldspecs=-fuse-linker-plugin
teensyDevBrd5.menu.opt.o1std=Fast
teensyDevBrd5.menu.opt.o1std.build.flags.optimize=-O1
teensyDevBrd5.menu.opt.o1std.build.flags.ldspecs=
teensyDevBrd5.menu.opt.o1lto=Fast with LTO
teensyDevBrd5.menu.opt.o1lto.build.flags.optimize=-O1 -flto -fno-fat-lto-objects
teensyDevBrd5.menu.opt.o1lto.build.flags.ldspecs=-fuse-linker-plugin
teensyDevBrd5.menu.opt.o3std=Fastest
teensyDevBrd5.menu.opt.o3std.build.flags.optimize=-O3
teensyDevBrd5.menu.opt.o3std.build.flags.ldspecs=
#teensyDevBrd5.menu.opt.o3purestd=Fastest + pure-code
#teensyDevBrd5.menu.opt.o3purestd.build.flags.optimize=-O3 -mpure-code -D__PURE_CODE__
#teensyDevBrd5.menu.opt.o3purestd.build.flags.ldspecs=
teensyDevBrd5.menu.opt.o3lto=Fastest with LTO
teensyDevBrd5.menu.opt.o3lto.build.flags.optimize=-O3 -flto -fno-fat-lto-objects
teensyDevBrd5.menu.opt.o3lto.build.flags.ldspecs=-fuse-linker-plugin
#teensyDevBrd5.menu.opt.o3purelto=Fastest + pure-code with LTO
#teensyDevBrd5.menu.opt.o3purelto.build.flags.optimize=-O3 -mpure-code -D__PURE_CODE__ -flto -fno-fat-lto-objects
#teensyDevBrd5.menu.opt.o3purelto.build.flags.ldspecs=-fuse-linker-plugin
teensyDevBrd5.menu.opt.ogstd=Debug
teensyDevBrd5.menu.opt.ogstd.build.flags.optimize=-Og
teensyDevBrd5.menu.opt.ogstd.build.flags.ldspecs=
#teensyDevBrd5.menu.opt.oglto=Debug with LTO
#teensyDevBrd5.menu.opt.oglto.build.flags.optimize=-Og -flto -fno-fat-lto-objects
#teensyDevBrd5.menu.opt.oglto.build.flags.ldspecs=-fuse-linker-plugin
teensyDevBrd5.menu.opt.osstd=Smallest Code
teensyDevBrd5.menu.opt.osstd.build.flags.optimize=-Os --specs=nano.specs
teensyDevBrd5.menu.opt.osstd.build.flags.ldspecs=
teensyDevBrd5.menu.opt.oslto=Smallest Code with LTO
teensyDevBrd5.menu.opt.oslto.build.flags.optimize=-Os -flto -fno-fat-lto-objects --specs=nano.specs
teensyDevBrd5.menu.opt.oslto.build.flags.ldspecs=-fuse-linker-plugin

teensyDevBrd5.menu.keys.en-us=US English
teensyDevBrd5.menu.keys.en-us.build.keylayout=US_ENGLISH
teensyDevBrd5.menu.keys.fr-ca=Canadian French
teensyDevBrd5.menu.keys.fr-ca.build.keylayout=CANADIAN_FRENCH
teensyDevBrd5.menu.keys.xx-ca=Canadian Multilingual
teensyDevBrd5.menu.keys.xx-ca.build.keylayout=CANADIAN_MULTILINGUAL
teensyDevBrd5.menu.keys.cz-cz=Czech
teensyDevBrd5.menu.keys.cz-cz.build.keylayout=CZECH
teensyDevBrd5.menu.keys.da-da=Danish
teensyDevBrd5.menu.keys.da-da.build.keylayout=DANISH
teensyDevBrd5.menu.keys.fi-fi=Finnish
teensyDevBrd5.menu.keys.fi-fi.build.keylayout=FINNISH
teensyDevBrd5.menu.keys.fr-fr=French
teensyDevBrd5.menu.keys.fr-fr.build.keylayout=FRENCH
teensyDevBrd5.menu.keys.fr-be=French Belgian
teensyDevBrd5.menu.keys.fr-be.build.keylayout=FRENCH_BELGIAN
teensyDevBrd5.menu.keys.fr-ch=French Swiss
teensyDevBrd5.menu.keys.fr-ch.build.keylayout=FRENCH_SWISS
teensyDevBrd5.menu.keys.de-de=German
teensyDevBrd5.menu.keys.de-de.build.keylayout=GERMAN
teensyDevBrd5.menu.keys.de-dm=German (Mac)
teensyDevBrd5.menu.keys.de-dm.build.keylayout=GERMAN_MAC
teensyDevBrd5.menu.keys.de-ch=German Swiss
teensyDevBrd5.menu.keys.de-ch.build.keylayout=GERMAN_SWISS
teensyDevBrd5.menu.keys.is-is=Icelandic
teensyDevBrd5.menu.keys.is-is.build.keylayout=ICELANDIC
teensyDevBrd5.menu.keys.en-ie=Irish
teensyDevBrd5.menu.keys.en-ie.build.keylayout=IRISH
teensyDevBrd5.menu.keys.it-it=Italian
teensyDevBrd5.menu.keys.it-it.build.keylayout=ITALIAN
teensyDevBrd5.menu.keys.no-no=Norwegian
teensyDevBrd5.menu.keys.no-no.build.keylayout=NORWEGIAN
teensyDevBrd5.menu.keys.pt-pt=Portuguese
teensyDevBrd5.menu.keys.pt-pt.build.keylayout=PORTUGUESE
teensyDevBrd5.menu.keys.pt-br=Portuguese Brazilian
teensyDevBrd5.menu.keys.pt-br.build.keylayout=PORTUGUESE_BRAZILIAN
teensyDevBrd5.menu.keys.rs-rs=Serbian (Latin Only)
teensyDevBrd5.menu.keys.rs-rs.build.keylayout=SERBIAN_LATIN_ONLY
teensyDevBrd5.menu.keys.es-es=Spanish
teensyDevBrd5.menu.keys.es-es.build.keylayout=SPANISH
teensyDevBrd5.menu.keys.es-mx=Spanish Latin America
teensyDevBrd5.menu.keys.es-mx.build.keylayout=SPANISH_LATIN_AMERICA
teensyDevBrd5.menu.keys.sv-se=Swedish
teensyDevBrd5.menu.keys.sv-se.build.keylayout=SWEDISH
teensyDevBrd5.menu.keys.tr-tr=Turkish (partial)
teensyDevBrd5.menu.keys.tr-tr.build.keylayout=TURKISH
teensyDevBrd5.menu.keys.en-gb=United Kingdom
teensyDevBrd5.menu.keys.en-gb.build.keylayout=UNITED_KINGDOM
teensyDevBrd5.menu.keys.usint=US International
teensyDevBrd5.menu.keys.usint.build.keylayout=US_INTERNATIONAL

